Tekla Open API Reference for Tekla Structures 2025
Double.Inequality Operator
 Compares a double value with a Datatype.Double value.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool operator !=(
	double Left,
	Double Right
)
Public Shared Operator <> (
	Left As Double,
	Right As Double
) As Boolean
Parameters
Left
Type: System.Double
The double value to be compared.
Right
Type: Tekla.Structures.Datatype.Double
The Datatype.Double value to be compared.
Return Value
Type: Boolean
True if the values are different.
See Also
Reference
Double Structure
Tekla.Structures.Datatype Namespace